-- אינדקס 1: על תאריך המשחק
-- מוטיבציה: כמעט כל השאילתות שלנו מסננות לפי שנה או חודש של המשחק. 
-- אינדקס כאן יאיץ משמעותית שליפות ועדכונים היסטוריים.
CREATE INDEX idx_match_date ON MATCH(MatchDate);

-- אינדקס 2: על סוג האירוע בטבלת אירועי משחק
-- מוטיבציה: המערכת כל הזמן מחפשת אירועים ספציפיים כמו 'Goal' כדי לחשב סטטיסטיקות מבקיעים או לספור שערים.
CREATE INDEX idx_match_event_type ON MATCH_EVENT(EventType);

-- אינדקס 3: על קוד נבחרת בטבלת שחקנים
-- מוטיבציה: חיפוש כל השחקנים השייכים לנבחרת מסוימת (למשל 'ITA' או 'ARG') היא פעולה נפוצה מאוד במערכת.
CREATE INDEX idx_player_teamcode ON PLAYER(TeamCode);